void setup()
{
  // Запишемо, що пін 3 є піном виводу, а пін А0 - вводу, хоча ми могли б цього і не робити, бо всі піни за замовчуванням є пінами входу.
  //
  pinMode(3, OUTPUT);
  pinMode(A0,INPUT);
  Serial.begin(9600);


void loop()
{
  int val, frequency;

  // Зчитаємо рівень освітленості так, як ми робимо це у випадку
  // потенціометра: в вигляді значення від 0 до 1023.
  val = analogRead(A0);
  //Serial.println (val);
  // розрахуємо частоту п'єзодинаміка в герцах (ноту),
  // використовуючи функцію проекцї (англ. map). Вона відображає значення одного діапазону
  // на інший, будуючи пропорцію.
  // В нашому іипадку [0; 1023] -> [100; 622]. Тобто від Соль великої октави до Ре дієз другої
  frequency = map(val, 0, 1023, 100, 622);

  // Змусимо пін зі звуковипромінювачем звучати
  // (англ. tone) з заданою частотою на 20 мілісекунд. При
  // наступних проходах loop, tone буде викликатися знову і знову,
  // і ми почуємо неперервний звук тональність, якого
  // залежить від кількості світла, що падає на фоторезистор
 tone(3, frequency, 20);
   Serial.println (frequency);
}
